dropna() With Subset

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'age': [12.0, np.nan, 14.0, 16.0],
    'height': [1.72, np.nan, 1.91, 1.54],
    'gender': ['M', 'F', np.nan, 'F']
})

In [3]:
df

    age  height gender
0  12.0    1.72      M
1   NaN     NaN      F
2  14.0    1.91    NaN
3  16.0    1.54      F

In [4]:
df.dropna()

    age  height gender
0  12.0    1.72      M
3  16.0    1.54      F

In [5]:
df.dropna(axis=0, how='any')

    age  height gender
0  12.0    1.72      M
3  16.0    1.54      F

In [ ]:
# the subset param

In [7]:
df

    age  height gender
0  12.0    1.72      M
1   NaN     NaN      F
2  14.0    1.91    NaN
3  16.0    1.54      F

In [6]:
df.dropna(axis=0, how='any', subset=['gender'])

    age  height gender
0  12.0    1.72      M
1   NaN     NaN      F
3  16.0    1.54      F

In [8]:
df.dropna(axis=0, how='any', subset=['age'])

    age  height gender
0  12.0    1.72      M
2  14.0    1.91    NaN
3  16.0    1.54      F

In [9]:
df

    age  height gender
0  12.0    1.72      M
1   NaN     NaN      F
2  14.0    1.91    NaN
3  16.0    1.54      F

In [10]:
df.dropna(axis=1, how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
# Word of this session is Orthogonal

In [11]:
df.dropna(axis=1, how='any', subset=[0, 2])

    age  height
0  12.0    1.72
1   NaN     NaN
2  14.0    1.91
3  16.0    1.54